[
  {
    "text": "Le titre EURO-CYCLES décroche après des résultats 2026 jugés décevants; la marge opérationnelle se contracte nettement. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "بيان حول برنامج تكوين أو يوم إعلامي يهم BT دون تأثير مباشر على الأرباح. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "ارتفاع الديون قصيرة الأجل لدى CARTHAGE CEMENT يثير مخاوف حول السيولة خلال 2026. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 30.7% sur la marge brute dès 2026. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "BIAT diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "Un incident opérationnel réduit la production de SFBT; la direction évoque un manque à gagner estimé à 274 MD.",
    "label": -1
  },
  {
    "text": "سهم SAH يتعرض لضغوط بيعية بعد إعلان نتائج دون التوقعات وتقلص هامش الربح. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "Le titre BNA décroche après des résultats 2025 jugés décevants; la marge opérationnelle se contracte nettement.",
    "label": -1
  },
  {
    "text": "تراجع المداخيل التشغيلية لدى STB وتأثر التدفقات النقدية خلال 2025. كما سجلت السوق تراجعا في الشهية للمخاطرة.",
    "label": -1
  },
  {
    "text": "SAH convoque son assemblée générale ordinaire au mois de septembre 2025 et publie l'ordre du jour. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "Note de marché : le titre BNA évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2024. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "Publication du rapport annuel de gouvernance de BT pour 2025, axé sur la conformité et la gestion des risques. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "تحديث قائمة الشركات المدرجة في توننداكس مع ذكر BT ضمن المكونات. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "Note de marché : le titre SOTUVER évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2026. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "SFBT réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2025.",
    "label": 1
  },
  {
    "text": "تسجيل خسائر صافية لدى STB خلال 2026 مع ارتفاع الأعباء المالية. ويتوقع محللون استمرار التذبذب إلى حين اتضاح الرؤية.",
    "label": -1
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ UNIMED. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "La Bourse de Tunis communique sur la révision de l'échantillon Tunindex 20; SFBT est mentionné dans la note. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "Publication du rapport annuel de gouvernance de SOTUVER pour 2026, axé sur la conformité et la gestion des risques. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "Le marché sanctionne SOTUVER après un avertissement sur résultats et une guidance prudente pour 2025.",
    "label": -1
  },
  {
    "text": "EURO-CYCLES convoque son assemblée générale ordinaire au mois de décembre 2025 et publie l'ordre du jour. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "تسجيل خسائر صافية لدى SOTIPAPIER خلال 2024 مع ارتفاع الأعباء المالية.",
    "label": -1
  },
  {
    "text": "La Bourse de Tunis communique sur la révision de l'échantillon Tunindex; SOTUVER est mentionné dans la note. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "La Bourse de Tunis communique sur la révision de l'échantillon indice des valeurs industrielles; ONE TECH HOLDING est mentionné dans la note. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "ارتفاع المبيعات نحو التصدير لدى TELNET HOLDING مع فتح أسواق جديدة خلال 2024. وأكدت الإدارة أن الاستثمارات الجديدة ستنعكس إيجابا على الإنتاج.",
    "label": 1
  },
  {
    "text": "Le titre SOTUVER s'envole en séance après des résultats T1 2026 supérieurs aux attentes, avec des revenus à 1567 MD. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 14.8% sur la marge brute dès 2025. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "تراجع المداخيل التشغيلية لدى BNA وتأثر التدفقات النقدية خلال 2026.",
    "label": -1
  },
  {
    "text": "CARTHAGE CEMENT affiche un bénéfice net en hausse de 13.4% en 2025, porté par une amélioration du PNB et une maîtrise des charges. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "إعلان عن مراجعة سلبية للتوقعات لدى SFBT بسبب ارتفاع كلفة المواد الأولية.",
    "label": -1
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ BT. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "Note de marché : le titre SOTUVER évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2025. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "تسجيل خسائر صافية لدى CARTHAGE CEMENT خلال 2026 مع ارتفاع الأعباء المالية. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "تراجع رقم معاملات STB بنسبة 34.0% خلال سنة 2025 نتيجة ارتفاع كلفة المواد الأولية وارتفاع الكلفة. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "Dans le secteur technologie, SOTIPAPIER annonce une progression de 3.9% de son chiffre d'affaires et relève ses objectifs pour 2027. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "سهم EURO-CYCLES يسجل ارتفاعا بعد نتائج الربع الثالث 2026 الإيجابية وتحقيق رقم معاملات في حدود 553.0 مليون دينار. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "SOTETEL annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2026.",
    "label": 1
  },
  {
    "text": "تحليل فني: تداولات سهم SFBT تتسم بالاستقرار النسبي في انتظار نشر نتائج جديدة.",
    "label": 0
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 13.5% sur la marge brute dès 2026. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "Note de marché : le titre BNA évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2026. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "تحسن هامش الربح لدى BNA بعد مراجعة سياسة التسعير وترشيد النفقات.",
    "label": 1
  },
  {
    "text": "ارتفاع الديون قصيرة الأجل لدى CARTHAGE CEMENT يثير مخاوف حول السيولة خلال 2024. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "إقرار توزيع أرباح على المساهمين مع زيادة في التوزيعات خلال 2024 بعد تحسن المؤشرات المالية. وتوقعت الإدارة المحافظة على نسق نمو مستقر.",
    "label": 1
  },
  {
    "text": "ONE TECH HOLDING annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2026. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "Un incident opérationnel réduit la production de UNIMED; la direction évoque un manque à gagner estimé à 1066 MD. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "Le titre SFBT s'envole en séance après des résultats T4 2025 supérieurs aux attentes, avec des revenus à 1805 MD. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "STB annonce un recul de 32.4% de son chiffre d'affaires en 2024, impacté par la recul des exportations. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "EURO-CYCLES réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2026. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "ارتفاع الديون قصيرة الأجل لدى ATTIJARI BANK يثير مخاوف حول السيولة خلال 2026. ويتوقع محللون استمرار التذبذب إلى حين اتضاح الرؤية.",
    "label": -1
  },
  {
    "text": "STB réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2025. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "BIAT annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2025. Les analystes saluent une amélioration de la trésorerie nette.",
    "label": 1
  },
  {
    "text": "تدهور مناخ السوق يدفع سهم STB للانخفاض وسط مخاوف من تشدد شروط التمويل.",
    "label": -1
  },
  {
    "text": "تحسن السيولة لدى SOTUVER وتراجع القروض المتعثرة، ما يعزز الثقة في استمرارية النمو خلال 2026.",
    "label": 1
  },
  {
    "text": "ارتفاع المبيعات نحو التصدير لدى SAH مع فتح أسواق جديدة خلال 2025. وأكدت الإدارة أن الاستثمارات الجديدة ستنعكس إيجابا على الإنتاج.",
    "label": 1
  },
  {
    "text": "تعيين مسؤول جديد داخل SFBT في إطار إعادة تنظيم الهيكلة الإدارية. ويتواصل الاهتمام بمتابعة المستجدات التنظيمية.",
    "label": 0
  },
  {
    "text": "Une séance calme : les échanges sur ONE TECH HOLDING restent limités, tandis que le marché consolide. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "Publication du rapport annuel de gouvernance de STB pour 2025, axé sur la conformité et la gestion des risques. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "BNA affiche un bénéfice net en hausse de 18.0% en 2025, porté par une amélioration du PNB et une maîtrise des charges. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "Grâce à des investissements ciblés, SFBT augmente ses ventes à l'export et consolide ses parts de marché en 2024. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "STB annonce un recul de 20.0% de son chiffre d'affaires en 2026, impacté par la dépréciation du dinar. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "BNA annonce la mise en ligne de ses états financiers au format PDF pour 2025 sur son site.",
    "label": 0
  },
  {
    "text": "BT annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2025. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "Un incident opérationnel réduit la production de SAH; la direction évoque un manque à gagner estimé à 289 MD. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "SFBT réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2026. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "Un incident opérationnel réduit la production de CARTHAGE CEMENT; la direction évoque un manque à gagner estimé à 554 MD. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "Dans le secteur bancaire, BIAT annonce une progression de 15.5% de son chiffre d'affaires et relève ses objectifs pour 2027. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "SFBT annonce la mise en ligne de ses états financiers au format PDF pour 2025 sur son site. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "تراجع رقم معاملات EURO-CYCLES بنسبة 16.9% خلال سنة 2026 نتيجة ارتفاع كلفة المواد الأولية وارتفاع الكلفة. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "تراجع المداخيل التشغيلية لدى BT وتأثر التدفقات النقدية خلال 2024.",
    "label": -1
  },
  {
    "text": "Un incident opérationnel réduit la production de CARTHAGE CEMENT; la direction évoque un manque à gagner estimé à 233 MD. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "Une séance calme : les échanges sur BT restent limités, tandis que le marché consolide. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 21.6% sur la marge brute dès 2027. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "شركة ONE TECH HOLDING تعلن عن نمو في الأرباح الصافية بنسبة 10.6% خلال سنة 2026 بفضل تحسن المداخيل والتحكم في المصاريف. وتوقعت الإدارة المحافظة على نسق نمو مستقر.",
    "label": 1
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ UNIMED. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "CARTHAGE CEMENT diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "Dans le secteur ciment, SOTIPAPIER enregistre une perte nette au T3 2024 et révise ses prévisions à la baisse. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ EURO-CYCLES. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "تدهور مناخ السوق يدفع سهم CARTHAGE CEMENT للانخفاض وسط مخاوف من تشدد شروط التمويل. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "EURO-CYCLES fait face à une hausse des créances classées, augmentant le risque perçu sur 2024. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "تحسن هامش الربح لدى SFBT بعد مراجعة سياسة التسعير وترشيد النفقات. وتوقعت الإدارة المحافظة على نسق نمو مستقر.",
    "label": 1
  },
  {
    "text": "تراجع المداخيل التشغيلية لدى BNA وتأثر التدفقات النقدية خلال 2024. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "تحسن السيولة لدى TELNET HOLDING وتراجع القروض المتعثرة، ما يعزز الثقة في استمرارية النمو خلال 2024. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "Les délais de paiement s'allongent et pèsent sur la trésorerie de BIAT, selon les indicateurs 2025. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "Communiqué : CARTHAGE CEMENT lance une campagne d'information client, sans incidence immédiate sur les profits. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "Le marché sanctionne ATTIJARI BANK après un avertissement sur résultats et une guidance prudente pour 2027. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "La Bourse de Tunis communique sur la révision de l'échantillon Tunindex 20; BIAT est mentionné dans la note.",
    "label": 0
  },
  {
    "text": "SAH annonce un recul de 16.4% de son chiffre d'affaires en 2026, impacté par la recul des exportations.",
    "label": -1
  },
  {
    "text": "TELNET HOLDING convoque son assemblée générale ordinaire au mois de mai 2024 et publie l'ordre du jour. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ SOTIPAPIER. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "تحليل فني: تداولات سهم BNA تتسم بالاستقرار النسبي في انتظار نشر نتائج جديدة. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "SOTIPAPIER affiche un bénéfice net en hausse de 28.4% en 2025, porté par une amélioration du PNB et une maîtrise des charges. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "تحسن هامش الربح لدى TELNET HOLDING بعد مراجعة سياسة التسعير وترشيد النفقات. وأكدت الإدارة أن الاستثمارات الجديدة ستنعكس إيجابا على الإنتاج.",
    "label": 1
  },
  {
    "text": "Le titre ATTIJARI BANK décroche après des résultats 2025 jugés décevants; la marge opérationnelle se contracte nettement. La volatilité s'accentue sur le marché.",
    "label": -1
  },
  {
    "text": "سهم SOTIPAPIER يسجل ارتفاعا بعد نتائج الربع الأول 2024 الإيجابية وتحقيق رقم معاملات في حدود 821 مليون دينار.",
    "label": 1
  },
  {
    "text": "Communiqué : SAH lance une campagne d'information client, sans incidence immédiate sur les profits. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "تسجيل خسائر صافية لدى BNA خلال 2026 مع ارتفاع الأعباء المالية.",
    "label": -1
  },
  {
    "text": "جلسة تداول هادئة: أحجام التداول على SOTIPAPIER محدودة والسوق في حالة ترقب. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "BNA convoque son assemblée générale ordinaire au mois de avril 2026 et publie l'ordre du jour.",
    "label": 0
  },
  {
    "text": "Un incident opérationnel réduit la production de SOTUVER; la direction évoque un manque à gagner estimé à 876 MD. La volatilité s'accentue sur le marché.",
    "label": -1
  },
  {
    "text": "Le marché sanctionne SAH après un avertissement sur résultats et une guidance prudente pour 2027. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "نشر بلاغ حول انعقاد الجلسة العامة العادية لشركة BIAT خلال سنة 2026 دون تفاصيل مالية إضافية. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "Note de marché : le titre BT évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2024. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "تعيين مسؤول جديد داخل CARTHAGE CEMENT في إطار إعادة تنظيم الهيكلة الإدارية. ويتواصل الاهتمام بمتابعة المستجدات التنظيمية.",
    "label": 0
  },
  {
    "text": "UNIMED diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "TELNET HOLDING diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "Dans le secteur agroalimentaire, STB annonce une progression de 4.7% de son chiffre d'affaires et relève ses objectifs pour 2025. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "EURO-CYCLES annonce un recul de 35.1% de son chiffre d'affaires en 2025, impacté par la tensions sur l'approvisionnement.",
    "label": -1
  },
  {
    "text": "ONE TECH HOLDING subit une pression vendeuse sur fond de craintes macroéconomiques et de hausse du coût du refinancement.",
    "label": -1
  },
  {
    "text": "TELNET HOLDING annonce un recul de 23.3% de son chiffre d'affaires en 2024, impacté par la baisse de la demande. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "Une séance calme : les échanges sur STB restent limités, tandis que le marché consolide.",
    "label": 0
  },
  {
    "text": "SFBT affiche un bénéfice net en hausse de 7.5% en 2024, porté par une amélioration du PNB et une maîtrise des charges. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "BT affiche un bénéfice net en hausse de 15.4% en 2025, porté par une amélioration du PNB et une maîtrise des charges. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "سهم SOTUVER يسجل ارتفاعا بعد نتائج الربع الثاني 2025 الإيجابية وتحقيق رقم معاملات في حدود 1879 مليون دينار. وتحدثت الشركة عن طلب قوي على منتجاتها خلال الفترة الأخيرة.",
    "label": 1
  },
  {
    "text": "Grâce à des investissements ciblés, SFBT augmente ses ventes à l'export et consolide ses parts de marché en 2026. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "Le titre SOTETEL décroche après des résultats 2026 jugés décevants; la marge opérationnelle se contracte nettement. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "إعلان عن مراجعة سلبية للتوقعات لدى ONE TECH HOLDING بسبب ضعف الطلب المحلي.",
    "label": -1
  },
  {
    "text": "STB annonce un recul de 4.8% de son chiffre d'affaires en 2024, impacté par la recul des exportations.",
    "label": -1
  },
  {
    "text": "SFBT réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2026. Les analystes saluent une amélioration de la trésorerie nette.",
    "label": 1
  },
  {
    "text": "تحسن هامش الربح لدى BIAT بعد مراجعة سياسة التسعير وترشيد النفقات. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "Un incident opérationnel réduit la production de SOTETEL; la direction évoque un manque à gagner estimé à 176 MD. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "ارتفاع المبيعات نحو التصدير لدى SOTETEL مع فتح أسواق جديدة خلال 2025. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "Le marché sanctionne CARTHAGE CEMENT après un avertissement sur résultats et une guidance prudente pour 2026. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "Le titre BT décroche après des résultats 2024 jugés décevants; la marge opérationnelle se contracte nettement. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "سهم UNIMED يتعرض لضغوط بيعية بعد إعلان نتائج دون التوقعات وتقلص هامش الربح. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "UNIMED annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2025.",
    "label": 1
  },
  {
    "text": "CARTHAGE CEMENT affiche un bénéfice net en hausse de 24.2% en 2025, porté par une amélioration du PNB et une maîtrise des charges. Les analystes saluent une amélioration de la trésorerie nette.",
    "label": 1
  },
  {
    "text": "Une séance calme : les échanges sur SAH restent limités, tandis que le marché consolide. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "تعيين مسؤول جديد داخل STB في إطار إعادة تنظيم الهيكلة الإدارية.",
    "label": 0
  },
  {
    "text": "SOTUVER annonce la mise en ligne de ses états financiers au format PDF pour 2025 sur son site.",
    "label": 0
  },
  {
    "text": "تحليل فني: تداولات سهم UNIMED تتسم بالاستقرار النسبي في انتظار نشر نتائج جديدة. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "Les délais de paiement s'allongent et pèsent sur la trésorerie de UNIMED, selon les indicateurs 2026. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "Un incident opérationnel réduit la production de SFBT; la direction évoque un manque à gagner estimé à 933.0 MD. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "توقيع عقد شراكة جديد يدعم مداخيل CARTHAGE CEMENT ويرفع آفاق النمو للسنة المقبلة. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "إقرار توزيع أرباح على المساهمين مع زيادة في التوزيعات خلال 2026 بعد تحسن المؤشرات المالية. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "Un incident opérationnel réduit la production de SFBT; la direction évoque un manque à gagner estimé à 1149.1 MD.",
    "label": -1
  },
  {
    "text": "تحسن السيولة لدى TELNET HOLDING وتراجع القروض المتعثرة، ما يعزز الثقة في استمرارية النمو خلال 2026. وأكدت الإدارة أن الاستثمارات الجديدة ستنعكس إيجابا على الإنتاج.",
    "label": 1
  },
  {
    "text": "Une séance calme : les échanges sur STB restent limités, tandis que le marché consolide. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "إعلان عن مراجعة سلبية للتوقعات لدى CARTHAGE CEMENT بسبب ارتفاع كلفة المواد الأولية. كما سجلت السوق تراجعا في الشهية للمخاطرة.",
    "label": -1
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 4.6% sur la marge brute dès 2026. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "STB réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2026. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "Le titre STB décroche après des résultats 2025 jugés décevants; la marge opérationnelle se contracte nettement. La volatilité s'accentue sur le marché.",
    "label": -1
  },
  {
    "text": "إقرار توزيع أرباح على المساهمين مع زيادة في التوزيعات خلال 2024 بعد تحسن المؤشرات المالية.",
    "label": 1
  },
  {
    "text": "Les délais de paiement s'allongent et pèsent sur la trésorerie de UNIMED, selon les indicateurs 2024. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "Une séance calme : les échanges sur SOTETEL restent limités, tandis que le marché consolide. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "شركة UNIMED تعلن عن نمو في الأرباح الصافية بنسبة 17.8% خلال سنة 2024 بفضل تحسن المداخيل والتحكم في المصاريف. وتحدثت الشركة عن طلب قوي على منتجاتها خلال الفترة الأخيرة.",
    "label": 1
  },
  {
    "text": "BNA réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2025. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "Note de marché : le titre SOTUVER évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2024.",
    "label": 0
  },
  {
    "text": "إقرار توزيع أرباح على المساهمين مع زيادة في التوزيعات خلال 2026 بعد تحسن المؤشرات المالية. وتوقعت الإدارة المحافظة على نسق نمو مستقر.",
    "label": 1
  },
  {
    "text": "تحليل فني: تداولات سهم SOTIPAPIER تتسم بالاستقرار النسبي في انتظار نشر نتائج جديدة. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "توقيع عقد شراكة جديد يدعم مداخيل STB ويرفع آفاق النمو للسنة المقبلة.",
    "label": 1
  },
  {
    "text": "La Bourse de Tunis communique sur la révision de l'échantillon indice des valeurs industrielles; SFBT est mentionné dans la note.",
    "label": 0
  },
  {
    "text": "إصدار تقرير سنوي حول الحوكمة والامتثال لدى SOTIPAPIER لسنة 2026. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "ATTIJARI BANK affiche un bénéfice net en hausse de 7.1% en 2026, porté par une amélioration du PNB et une maîtrise des charges. Les analystes saluent une amélioration de la trésorerie nette.",
    "label": 1
  },
  {
    "text": "SFBT annonce la mise en ligne de ses états financiers au format PDF pour 2024 sur son site. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "توقيع عقد شراكة جديد يدعم مداخيل BIAT ويرفع آفاق النمو للسنة المقبلة.",
    "label": 1
  },
  {
    "text": "بيان حول برنامج تكوين أو يوم إعلامي يهم SOTIPAPIER دون تأثير مباشر على الأرباح. ويتواصل الاهتمام بمتابعة المستجدات التنظيمية.",
    "label": 0
  },
  {
    "text": "ATTIJARI BANK réduit le coût du risque et augmente ses provisions de couverture, ce qui rassure le marché sur 2024. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "STB annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2024. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "تراجع المداخيل التشغيلية لدى STB وتأثر التدفقات النقدية خلال 2024. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "STB améliore son coefficient d'exploitation et renforce sa solvabilité, confirmant une trajectoire positive sur l'exercice 2025. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "Dans le secteur leasing, TELNET HOLDING enregistre une perte nette au T4 2025 et révise ses prévisions à la baisse.",
    "label": -1
  },
  {
    "text": "ارتفاع المبيعات نحو التصدير لدى BT مع فتح أسواق جديدة خلال 2024. وتوقعت الإدارة المحافظة على نسق نمو مستقر.",
    "label": 1
  },
  {
    "text": "شركة STB تعلن عن نمو في الأرباح الصافية بنسبة 28.1% خلال سنة 2026 بفضل تحسن المداخيل والتحكم في المصاريف.",
    "label": 1
  },
  {
    "text": "تراجع المداخيل التشغيلية لدى UNIMED وتأثر التدفقات النقدية خلال 2025. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "UNIMED affiche un bénéfice net en hausse de 31.2% en 2024, porté par une amélioration du PNB et une maîtrise des charges. Les analystes saluent une amélioration de la trésorerie nette.",
    "label": 1
  },
  {
    "text": "STB annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2024.",
    "label": 1
  },
  {
    "text": "إقرار توزيع أرباح على المساهمين مع زيادة في التوزيعات خلال 2025 بعد تحسن المؤشرات المالية.",
    "label": 1
  },
  {
    "text": "Le marché sanctionne CARTHAGE CEMENT après un avertissement sur résultats et une guidance prudente pour 2026. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "تراجع رقم معاملات EURO-CYCLES بنسبة 37.6% خلال سنة 2026 نتيجة اضطرابات لوجستية وارتفاع الكلفة. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "Le titre UNIMED gagne en séance après des résultats T4 2026 supérieurs aux attentes, avec des revenus à 1799.6 MD.",
    "label": 1
  },
  {
    "text": "Le titre STB décroche après des résultats 2024 jugés décevants; la marge opérationnelle se contracte nettement. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "Note de marché : le titre BIAT évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2024.",
    "label": 0
  },
  {
    "text": "تحذيرات من اضطراب في الإنتاج لدى ATTIJARI BANK بعد عطل تقني، وتقدير خسائر بنحو 203.6 مليون دينار. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "SAH affiche un bénéfice net en hausse de 10.4% en 2024, porté par une amélioration du PNB et une maîtrise des charges.",
    "label": 1
  },
  {
    "text": "SOTUVER annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2026. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "UNIMED convoque son assemblée générale ordinaire au mois de octobre 2024 et publie l'ordre du jour. Les investisseurs restent en mode observation.",
    "label": 0
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 22.2% sur la marge brute dès 2027.",
    "label": 1
  },
  {
    "text": "STB diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "نشر بلاغ حول انعقاد الجلسة العامة العادية لشركة STB خلال سنة 2025 دون تفاصيل مالية إضافية.",
    "label": 0
  },
  {
    "text": "SAH annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2024.",
    "label": 1
  },
  {
    "text": "إتمام عملية استثمار صناعي جديد لدى SOTETEL سيزيد الطاقة الإنتاجية ابتداء من 2027. وأكدت الإدارة أن الاستثمارات الجديدة ستنعكس إيجابا على الإنتاج.",
    "label": 1
  },
  {
    "text": "تحذيرات من اضطراب في الإنتاج لدى SOTIPAPIER بعد عطل تقني، وتقدير خسائر بنحو 381 مليون دينار. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "TELNET HOLDING annonce un dividende en hausse et une politique de distribution plus régulière à partir de 2024.",
    "label": 1
  },
  {
    "text": "SOTETEL convoque son assemblée générale ordinaire au mois de juin 2025 et publie l'ordre du jour. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "تحسن هامش الربح لدى STB بعد مراجعة سياسة التسعير وترشيد النفقات. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ SAH. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "UNIMED annonce un recul de 11.4% de son chiffre d'affaires en 2026, impacté par la recul des exportations. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "CARTHAGE CEMENT subit une pression vendeuse sur fond de craintes macroéconomiques et de hausse du coût du refinancement. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "ارتفاع المبيعات نحو التصدير لدى SOTIPAPIER مع فتح أسواق جديدة خلال 2026. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 10.0% sur la marge brute dès 2026. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "جلسة تداول هادئة: أحجام التداول على SFBT محدودة والسوق في حالة ترقب. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "تدهور مناخ السوق يدفع سهم EURO-CYCLES للانخفاض وسط مخاوف من تشدد شروط التمويل. وتبقى التوقعات قصيرة المدى حذرة.",
    "label": -1
  },
  {
    "text": "سهم SOTUVER يسجل ارتفاعا بعد نتائج الربع الرابع 2025 الإيجابية وتحقيق رقم معاملات في حدود 114 مليون دينار. كما أشار البلاغ إلى تحسن في التدفقات النقدية التشغيلية.",
    "label": 1
  },
  {
    "text": "Le conseil valide un plan d'expansion et estime un impact positif de 12.2% sur la marge brute dès 2027. Les analystes saluent une amélioration de la trésorerie nette.",
    "label": 1
  },
  {
    "text": "BIAT fait face à une hausse des créances classées, augmentant le risque perçu sur 2025.",
    "label": -1
  },
  {
    "text": "إعلان عن مراجعة سلبية للتوقعات لدى UNIMED بسبب تراجع الصادرات. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "Publication du rapport annuel de gouvernance de EURO-CYCLES pour 2024, axé sur la conformité et la gestion des risques.",
    "label": 0
  },
  {
    "text": "سهم ONE TECH HOLDING يتعرض لضغوط بيعية بعد إعلان نتائج دون التوقعات وتقلص هامش الربح. ويتوقع محللون استمرار التذبذب إلى حين اتضاح الرؤية.",
    "label": -1
  },
  {
    "text": "Grâce à des investissements ciblés, CARTHAGE CEMENT augmente ses ventes à l'export et consolide ses parts de marché en 2024. La société indique une meilleure rotation des stocks et une réduction des délais clients.",
    "label": 1
  },
  {
    "text": "BT subit une pression vendeuse sur fond de craintes macroéconomiques et de hausse du coût du refinancement. La volatilité s'accentue sur le marché.",
    "label": -1
  },
  {
    "text": "CARTHAGE CEMENT subit une pression vendeuse sur fond de craintes macroéconomiques et de hausse du coût du refinancement. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "Le titre BIAT grimpe en séance après des résultats T2 2026 supérieurs aux attentes, avec des revenus à 671.5 MD. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "EURO-CYCLES annonce un recul de 6.8% de son chiffre d'affaires en 2025, impacté par la baisse de la demande. La volatilité s'accentue sur le marché.",
    "label": -1
  },
  {
    "text": "Le titre SFBT s'envole en séance après des résultats T1 2024 supérieurs aux attentes, avec des revenus à 793.7 MD. Les flux acheteurs se renforcent sur le compartiment des grandes capitalisations.",
    "label": 1
  },
  {
    "text": "تعيين مسؤول جديد داخل SAH في إطار إعادة تنظيم الهيكلة الإدارية. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "نشر بلاغ حول انعقاد الجلسة العامة العادية لشركة BIAT خلال سنة 2026 دون تفاصيل مالية إضافية.",
    "label": 0
  },
  {
    "text": "STB affiche un bénéfice net en hausse de 30.8% en 2024, porté par une amélioration du PNB et une maîtrise des charges. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "تعيين مسؤول جديد داخل TELNET HOLDING في إطار إعادة تنظيم الهيكلة الإدارية. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "SOTIPAPIER fait face à une hausse des créances classées, augmentant le risque perçu sur 2026. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "تحسن هامش الربح لدى BIAT بعد مراجعة سياسة التسعير وترشيد النفقات.",
    "label": 1
  },
  {
    "text": "Les délais de paiement s'allongent et pèsent sur la trésorerie de UNIMED, selon les indicateurs 2024. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "Communiqué : STB lance une campagne d'information client, sans incidence immédiate sur les profits. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "تحذيرات من اضطراب في الإنتاج لدى TELNET HOLDING بعد عطل تقني، وتقدير خسائر بنحو 151.5 مليون دينار. ويتوقع محللون استمرار التذبذب إلى حين اتضاح الرؤية.",
    "label": -1
  },
  {
    "text": "SOTETEL annonce un recul de 10.2% de son chiffre d'affaires en 2026, impacté par la tensions sur l'approvisionnement. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "إتمام عملية استثمار صناعي جديد لدى SOTIPAPIER سيزيد الطاقة الإنتاجية ابتداء من 2027. وتوقعت الإدارة المحافظة على نسق نمو مستقر.",
    "label": 1
  },
  {
    "text": "Note de marché : le titre EURO-CYCLES évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2025.",
    "label": 0
  },
  {
    "text": "تحسن هامش الربح لدى BT بعد مراجعة سياسة التسعير وترشيد النفقات. وتحدثت الشركة عن طلب قوي على منتجاتها خلال الفترة الأخيرة.",
    "label": 1
  },
  {
    "text": "إصدار تقرير سنوي حول الحوكمة والامتثال لدى BT لسنة 2026.",
    "label": 0
  },
  {
    "text": "تحسن هامش الربح لدى SOTUVER بعد مراجعة سياسة التسعير وترشيد النفقات. وتحدثت الشركة عن طلب قوي على منتجاتها خلال الفترة الأخيرة.",
    "label": 1
  },
  {
    "text": "تحليل فني: تداولات سهم BNA تتسم بالاستقرار النسبي في انتظار نشر نتائج جديدة. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "سهم BNA يسجل ارتفاعا بعد نتائج الربع الثاني 2025 الإيجابية وتحقيق رقم معاملات في حدود 1359.9 مليون دينار. وتحدثت الشركة عن طلب قوي على منتجاتها خلال الفترة الأخيرة.",
    "label": 1
  },
  {
    "text": "بيان حول برنامج تكوين أو يوم إعلامي يهم SOTIPAPIER دون تأثير مباشر على الأرباح. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "Le marché sanctionne SOTETEL après un avertissement sur résultats et une guidance prudente pour 2027. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "Une séance calme : les échanges sur ONE TECH HOLDING restent limités, tandis que le marché consolide. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "Une séance calme : les échanges sur TELNET HOLDING restent limités, tandis que le marché consolide. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "Un incident opérationnel réduit la production de SOTIPAPIER; la direction évoque un manque à gagner estimé à 476.5 MD. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "Note de marché : le titre SAH évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2024. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ BNA. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "تحذيرات من اضطراب في الإنتاج لدى STB بعد عطل تقني، وتقدير خسائر بنحو 461 مليون دينار. وقد يؤدي ذلك إلى مزيد من الضغط على السهم.",
    "label": -1
  },
  {
    "text": "سهم TELNET HOLDING يتعرض لضغوط بيعية بعد إعلان نتائج دون التوقعات وتقلص هامش الربح. كما سجلت السوق تراجعا في الشهية للمخاطرة.",
    "label": -1
  },
  {
    "text": "BT annonce un recul de 35.3% de son chiffre d'affaires en 2024, impacté par la dépréciation du dinar. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "جلسة تداول هادئة: أحجام التداول على UNIMED محدودة والسوق في حالة ترقب. ولم يتم الإعلان عن أرقام جديدة بخصوص المبيعات.",
    "label": 0
  },
  {
    "text": "Le titre SOTIPAPIER décroche après des résultats 2026 jugés décevants; la marge opérationnelle se contracte nettement.",
    "label": -1
  },
  {
    "text": "Note de marché : le titre SFBT évolue dans un range étroit, dans l'attente de nouvelles informations sur l'exercice 2024. Aucune guidance n'a été donnée pour le trimestre suivant.",
    "label": 0
  },
  {
    "text": "EURO-CYCLES fait face à une hausse des créances classées, augmentant le risque perçu sur 2025. Les volumes de vente restent supérieurs à la moyenne des dernières séances.",
    "label": -1
  },
  {
    "text": "تدهور مناخ السوق يدفع سهم EURO-CYCLES للانخفاض وسط مخاوف من تشدد شروط التمويل. كما سجلت السوق تراجعا في الشهية للمخاطرة.",
    "label": -1
  },
  {
    "text": "تعيين مسؤول جديد داخل TELNET HOLDING في إطار إعادة تنظيم الهيكلة الإدارية. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "BIAT diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "BIAT fait face à une hausse des créances classées, augmentant le risque perçu sur 2026. Le support technique est testé à plusieurs reprises.",
    "label": -1
  },
  {
    "text": "تعيين مسؤول جديد داخل ATTIJARI BANK في إطار إعادة تنظيم الهيكلة الإدارية. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "La Bourse de Tunis communique sur la révision de l'échantillon Tunindex 20; BNA est mentionné dans la note. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "ATTIJARI BANK améliore son coefficient d'exploitation et renforce sa solvabilité, confirmant une trajectoire positive sur l'exercice 2024. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  },
  {
    "text": "تدهور مناخ السوق يدفع سهم CARTHAGE CEMENT للانخفاض وسط مخاوف من تشدد شروط التمويل. كما سجلت السوق تراجعا في الشهية للمخاطرة.",
    "label": -1
  },
  {
    "text": "BT diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. La publication est conforme au calendrier réglementaire.",
    "label": 0
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ BNA. وتبقى حركة السوق محدودة مع أحجام تداول ضعيفة.",
    "label": 0
  },
  {
    "text": "Une séance calme : les échanges sur BT restent limités, tandis que le marché consolide.",
    "label": 0
  },
  {
    "text": "نشر رزنامة الإفصاح المالي وتواريخ التقارير الدورية الخاصة بـ BT. ويُنتظر صدور المؤشرات الفصلية خلال الفترة القادمة.",
    "label": 0
  },
  {
    "text": "Le titre SOTUVER décroche après des résultats 2025 jugés décevants; la marge opérationnelle se contracte nettement. Les analystes pointent un risque accru sur la liquidité et recommandent la prudence à court terme.",
    "label": -1
  },
  {
    "text": "CARTHAGE CEMENT diffuse un communiqué sur une nomination au top management, sans indicateurs financiers chiffrés. Les volumes demeurent faibles malgré une légère volatilité.",
    "label": 0
  },
  {
    "text": "Dans le secteur ciment, UNIMED annonce une progression de 5.0% de son chiffre d'affaires et relève ses objectifs pour 2026. La direction évoque un carnet de commandes bien orienté.",
    "label": 1
  }
]